# RbsFpSprinklerTemperatureRatingParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsFpSprinklerTemperatureRatingParam Property
ParameterTypeId Class See Also
---
"Temperature Rating"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsFpSprinklerTemperatureRatingParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsFpSprinklerTemperatureRatingParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsFpSprinklerTemperatureRatingParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace